export const ZODIACS = [
            { name: '鼠🐭', desc: '机智敏锐，灵活多变，具有强烈的适应能力和进取心。' },
            { name: '牛🐮', desc: '勤勉踏实，诚实可靠，做事有着坚韧不拔的毅力。' },
            { name: '虎🐯', desc: '勇敢自信，充满活力，天生具有领导力和冒险精神。' },
            { name: '兔🐰', desc: '温柔善良，心思细腻，向往和平与和谐的生活环境。' },
            { name: '龙🐲', desc: '气宇轩昂，充满智慧，有着远大的理想和抱负。' },
            { name: '蛇🐍', desc: '神秘睿智，外表冷峻内心热情，有着极强的直觉力。' },
            { name: '马🐴', desc: '热情奔放，向往自由，有着不折不挠的进取精神。' },
            { name: '羊🐑', desc: '温文尔雅，富有同情心，具有浓厚的人情味和艺术气质。' },
            { name: '猴🐵', desc: '聪明伶俐，幽默风趣，多才多艺且有着极强的好奇心。' },
            { name: '鸡🐔', desc: '勤奋守信，神采奕奕，做事果断且有着出色的表达能力。' },
            { name: '狗🐶', desc: '忠诚可靠，正直勇敢，对朋友和家人充满责任感。' },
            { name: '猪🐷', desc: '豁达开朗，诚实善良，懂得享受生活且有着好人缘。' }
];
export function zodiacIndexByYear(year){
  return ((year - 2020) % 12 + 12) % 12;
}
